In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
fb_dataset_path = '../data/fb.json'
olx_dataset_path = '../data/olx_remote_work.json'
o24_dataset_path = '../data/oglaszamy24.json'
jh_dataset_path = '../data/jobhunter_cleaned.json'

In [3]:
df_fb = pd.read_json(fb_dataset_path)
df_olx = pd.read_json(olx_dataset_path)
df_o24 = pd.read_json(o24_dataset_path)
df_jh = pd.read_json(jh_dataset_path)

In [4]:
df_fb.head()

                 id                                               text
0  1357999284721525  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...
1  1512648315923287  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...
2  1512730425915076  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...
3  1512510969270355  W związku z dynamicznie rozwijającym się Zespo...
4  1505264493328336  Przy komputerze\nUmowa, wynagrodzenie co miesi...

In [5]:
df_fb.drop(columns=['id'], inplace=True)

In [6]:
df_olx.head()

                                        descriptions
0  Nie, to nie pomyłka! Nie musisz dalej szukać, ...
1  W związku z prężnie rozwijającym się projektem...
2  Poszukujemy osoby do pracy zdalnej na stanowis...
3  Wynagrodzenie: 5-7 tys. zł.Umowa o pracęGodz. ...
4  Jesteś studentem kierunków informatycznych lub...

In [7]:
df_olx.rename(columns={'descriptions': 'text'}, inplace=True)

In [8]:
df_o24.head()

,Title,Description
0,400 zł za spotkanie dla Pani / Kraków,"Witam, tak jak w tytule poszukuję kobiete do s..."
1,Konsolidacja długów / Opole,"Chcesz zbudować, odnowić, przywrócić lub po pr..."
2,"Badania wysokościowe od ręki ,medycyna pracy ...","Medycyna pracy od ręki ,badania wysokościowe,\..."
3,"Badania medycyny pracy,błyskawiczna wysyłka na...","Medycyna pracy od ręki ,badania wysokościowe,\..."
4,"Medycyna pracy,badania wysokościowe,książeczka...","Medycyna pracy od ręki ,badania wysokościowe,\..."

In [9]:
df_o24['text'] = df_o24[['Title', 'Description']].apply(lambda row: '\n'.join(row.values.astype(str)), axis=1)
df_o24.drop(columns=['Title', 'Description'], inplace=True)

In [10]:
df_jh.head()

                                                text  label
0  Poszukujemy osoby do obsługi klienta, która bę...      0
1  Poszukujemy Specjalisty ds. Obsługi Klienta, k...      0
2  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
3  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
4  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0

In [11]:
df_fb['label'] = np.nan
df_olx['label'] = np.nan
df_o24['label'] = np.nan

In [12]:
df_fb.head()

                                                text  label
0  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...    NaN
1  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...    NaN
2  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...    NaN
3  W związku z dynamicznie rozwijającym się Zespo...    NaN
4  Przy komputerze\nUmowa, wynagrodzenie co miesi...    NaN

In [13]:
df_olx.head()

                                                text  label
0  Nie, to nie pomyłka! Nie musisz dalej szukać, ...    NaN
1  W związku z prężnie rozwijającym się projektem...    NaN
2  Poszukujemy osoby do pracy zdalnej na stanowis...    NaN
3  Wynagrodzenie: 5-7 tys. zł.Umowa o pracęGodz. ...    NaN
4  Jesteś studentem kierunków informatycznych lub...    NaN

In [14]:
df_o24.head()

                                                text  label
0  400 zł za spotkanie dla Pani / Kraków\nWitam, ...    NaN
1  Konsolidacja długów / Opole\nChcesz zbudować, ...    NaN
2  Badania wysokościowe  od ręki ,medycyna pracy ...    NaN
3  Badania medycyny pracy,błyskawiczna wysyłka na...    NaN
4  Medycyna pracy,badania wysokościowe,książeczka...    NaN

In [15]:
df_jh.head()

                                                text  label
0  Poszukujemy osoby do obsługi klienta, która bę...      0
1  Poszukujemy Specjalisty ds. Obsługi Klienta, k...      0
2  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
3  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0
4  Stanowisko: Specjalista ds. Obsługi Klienta  -...      0

In [16]:
df_all = pd.concat([df_fb, df_olx, df_o24, df_jh], ignore_index=True)
df_all.head()

                                                text  label
0  ‼️‼️4.000 - 6.000 zł za spisanie i zamknięcie ...    NaN
1  WARSZAWA!\n\nPotrzebuję hostessy lub hosta! 🙂\...    NaN
2  PRACA OD JUTRA\nZatrudnię pełnoletnie osoby do...    NaN
3  W związku z dynamicznie rozwijającym się Zespo...    NaN
4  Przy komputerze\nUmowa, wynagrodzenie co miesi...    NaN

In [17]:
df_all.shape

(3359, 2)

In [18]:
df_all['text'].nunique()

2908

In [19]:
df_all.dropna(subset=['text'], inplace=True)

In [20]:
df_all['text'] = df_all['text'].apply(lambda x: re.sub('[\W]+', ' ', x))

In [21]:
df_all['text'] = df_all['text'].apply(str.lower)

In [22]:
df_all.head()

                                                text  label
0   4 000 6 000 zł za spisanie i zamknięcie 1 umo...    NaN
1  warszawa potrzebuję hostessy lub hosta 30 11 0...    NaN
2  praca od jutra zatrudnię pełnoletnie osoby do ...    NaN
3  w związku z dynamicznie rozwijającym się zespo...    NaN
4  przy komputerze umowa wynagrodzenie co miesiąc...    NaN

In [23]:
df_all.to_csv('../data/all_cleaned_data.csv', index=False)
with open('../data/all_cleaned_data.json', 'w', encoding='utf-8') as f:
  df_all.to_json(f, force_ascii=False, orient='records')